---
title: ConduitSize
classe: Autodesk.Revit.DB.Electrical.ConduitSize
namespace: Autodesk.Revit.DB.Electrical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# ConduitSize

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double BendRadius { get; }` | `conduitSize.BendRadius` | Double |
| `Double InnerDiameter { get; }` | `conduitSize.InnerDiameter` | Double |
| `Boolean IsValidObject { get; }` | `conduitSize.IsValidObject` | Boolean |
| `Double NominalDiameter { get; }` | `conduitSize.NominalDiameter` | Double |
| `Double OuterDiameter { get; }` | `conduitSize.OuterDiameter` | Double |
| `Boolean UsedInSizeLists { get; }` | `conduitSize.UsedInSizeLists` | Boolean |
| `Boolean UsedInSizing { get; }` | `conduitSize.UsedInSizing` | Boolean |
| `Void Dispose()` | `conduitSize.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```